---
title: "Useful operations on a DataFrame"
author: "Yagan Arun"
date: 2020-08-12
description: "-"
type: technical_note
draft: false
---

In [1]:
import pandas as pd

In [27]:
cars = [['Audi' , 10] , ['Apple' , None] , ['Lambhorghini',10] , ['Bens',9] , ['Samsung',None] , ['Google',None] , ['Apple',None]]
df = pd.DataFrame(data = cars , columns = ['Cars' , 'Rating'])

In [28]:
df

           Cars  Rating
0          Audi    10.0
1         Apple     NaN
2  Lambhorghini    10.0
3          Bens     9.0
4       Samsung     NaN
5        Google     NaN
6         Apple     NaN

In [29]:
# Operation 1 : finding columns in a dataframe
df.columns

Index(['Cars', 'Rating'], dtype='object')

In [30]:
# Operation 2 : knowing the row and columns in a dataframe
row , column = df.shape[0] , df.shape[1]
print('no of rows : {} , no of columns : {} '.format(row , column))

no of rows : 7 , no of columns : 2

In [31]:
# Operation 3 : Knowing first 5 rows in a dataframe 
df.head()

           Cars  Rating
0          Audi    10.0
1         Apple     NaN
2  Lambhorghini    10.0
3          Bens     9.0
4       Samsung     NaN

In [32]:
# Operation 4 : Knowing last 5 rows in a dataframe 
df.tail()

           Cars  Rating
2  Lambhorghini    10.0
3          Bens     9.0
4       Samsung     NaN
5        Google     NaN
6         Apple     NaN

In [33]:
# Operation 5 : To know unique values in a dataframe ==> df.column_name.unique()
df.Cars.unique()

array(['Audi', 'Apple', 'Lambhorghini', 'Bens', 'Samsung', 'Google'],
      dtype=object)

In [38]:
# Operation 6 : getting count of each entities in a column.
df['Cars'].value_counts()

Apple           2
Lambhorghini    1
Samsung         1
Bens            1
Google          1
Audi            1
Name: Cars, dtype: int64

In [40]:
# Operation 7 : grouping data in a data frame
# here dataframe is grouped based on rating 
df.groupby(['Rating'])['Cars'].count()

Rating
9.0     1
10.0    2
Name: Cars, dtype: int64